#pragma once

// -- 前向声明 --------------------------------------------------------------------
class AppController; 

// -- 类定义 ----------------------------------------------------------------------
class AppBase {
public:
    virtual ~AppBase() {}                         // 虚析构函数，确保正确释放

    // -- 核心生命周期 ------------------------------------------------------------
    virtual void onRun(AppController* sys) = 0;   // 应用入口
    virtual int onLoop() = 0;                     // 主循环 (返回0表示继续运行)
    virtual void onExit() {}                      // 清理工作
    
    // -- 属性配置 ----------------------------------------------------------------
    virtual bool isKeepAlive() { return false; }  // 默认不保持屏幕常亮
};